programmingprojects/flutterprojects/Streamline/AOE_MOSAIC_APP-mega_super_commenting_speed_ultra_branch_wow_amazing_good_stuff/example_SOAP_API_calls/ManageServiceProvisioning/deleteService.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mod="http://models.ws.common.adtran.com" xmlns:ns0="http://serviceactivation.models.ws.common.adtran.com">

   <soapenv:Header>
      <mod:aoewsHeader>
         <aoewss>
            <userName>admin</userName>
            <password>password</password>
         </aoewss>
      </mod:aoewsHeader>
   </soapenv:Header>
   <soapenv:Body>
      <ns0:deleteServiceRequest>
		
		<!--Can find via equipment, subscriberID, or serial wrapper-->
		<subscriberId>ORANGE</subscriberId>

      </ns0:deleteServiceRequest>
   </soapenv:Body>
</soapenv:Envelope>